Revit 2024 API
ExternalResourceLoadContent.Version Property
 The version of the external data that the server is providing in this object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string Version { get; set; }
Visual Basic
Public Property Version As String
	Get
	Set
Visual C++
public:
property String^ Version {
	String^ get ();
	void set (String^ value);
}
Remarks
When its LoadResource() method is invoked, an IExternalResourceServer can indicate the version of the data that it is providing to Revit by setting this property. Doing so will improve performance, because Revit will use the version information to avoid unnecessary reloads.
See GetResourceVersionStatus(ExternalResourceReference).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace